ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/pm.h
/*
 * Component description for PM
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_PM_COMPONENT_H_
#define _SAMD21_PM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PM                                           */
/* ************************************************************************** */

/* -------- PM_CTRL : (PM Offset: 0x00) (R/W 8) Control -------- */
#define PM_CTRL_RESETVALUE _UINT8_(0x00) /*  (PM_CTRL) Control  Reset Value */

#define PM_CTRL_Msk _UINT8_(0x00) /* (PM_CTRL) Register Mask  */


/* -------- PM_SLEEP : (PM Offset: 0x01) (R/W 8) Sleep Mode -------- */
#define PM_SLEEP_RESETVALUE _UINT8_(0x00) /*  (PM_SLEEP) Sleep Mode  Reset Value */

#define PM_SLEEP_IDLE_Pos _UINT8_(0) /* (PM_SLEEP) Idle Mode Configuration Position */
#define PM_SLEEP_IDLE_Msk (_UINT8_(0x3) << PM_SLEEP_IDLE_Pos) /* (PM_SLEEP) Idle Mode Configuration Mask */
#define PM_SLEEP_IDLE(value)                                                                                           \
        (PM_SLEEP_IDLE_Msk &                                                                                           \
         (_UINT8_(value) << PM_SLEEP_IDLE_Pos)) /* Assigment of value for IDLE in the PM_SLEEP register */
#define PM_SLEEP_IDLE_CPU_Val _UINT8_(0x0) /* (PM_SLEEP) The CPU clock domain is stopped  */
#define PM_SLEEP_IDLE_AHB_Val _UINT8_(0x1) /* (PM_SLEEP) The CPU and AHB clock domains are stopped  */
#define PM_SLEEP_IDLE_APB_Val _UINT8_(0x2) /* (PM_SLEEP) The CPU, AHB and APB clock domains are stopped  */
#define PM_SLEEP_IDLE_CPU                                                                                              \
        (PM_SLEEP_IDLE_CPU_Val << PM_SLEEP_IDLE_Pos) /* (PM_SLEEP) The CPU clock domain is stopped Position  */
#define PM_SLEEP_IDLE_AHB                                                                                              \
        (PM_SLEEP_IDLE_AHB_Val                                                                                         \
         << PM_SLEEP_IDLE_Pos) /* (PM_SLEEP) The CPU and AHB clock domains are stopped Position  */
#define PM_SLEEP_IDLE_APB                                                                                              \
        (PM_SLEEP_IDLE_APB_Val                                                                                         \
         << PM_SLEEP_IDLE_Pos) /* (PM_SLEEP) The CPU, AHB and APB clock domains are stopped Position  */
#define PM_SLEEP_Msk _UINT8_(0x03) /* (PM_SLEEP) Register Mask  */


/* -------- PM_CPUSEL : (PM Offset: 0x08) (R/W 8) CPU Clock Select -------- */
#define PM_CPUSEL_RESETVALUE _UINT8_(0x00) /*  (PM_CPUSEL) CPU Clock Select  Reset Value */

#define PM_CPUSEL_CPUDIV_Pos _UINT8_(0) /* (PM_CPUSEL) CPU Prescaler Selection Position */
#define PM_CPUSEL_CPUDIV_Msk (_UINT8_(0x7) << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) CPU Prescaler Selection Mask */
#define PM_CPUSEL_CPUDIV(value)                                                                                        \
        (PM_CPUSEL_CPUDIV_Msk &                                                                                        \
         (_UINT8_(value) << PM_CPUSEL_CPUDIV_Pos)) /* Assigment of value for CPUDIV in the PM_CPUSEL register */
#define PM_CPUSEL_CPUDIV_DIV1_Val _UINT8_(0x0) /* (PM_CPUSEL) Divide by 1  */
#define PM_CPUSEL_CPUDIV_DIV2_Val _UINT8_(0x1) /* (PM_CPUSEL) Divide by 2  */
#define PM_CPUSEL_CPUDIV_DIV4_Val _UINT8_(0x2) /* (PM_CPUSEL) Divide by 4  */
#define PM_CPUSEL_CPUDIV_DIV8_Val _UINT8_(0x3) /* (PM_CPUSEL) Divide by 8  */
#define PM_CPUSEL_CPUDIV_DIV16_Val _UINT8_(0x4) /* (PM_CPUSEL) Divide by 16  */
#define PM_CPUSEL_CPUDIV_DIV32_Val _UINT8_(0x5) /* (PM_CPUSEL) Divide by 32  */
#define PM_CPUSEL_CPUDIV_DIV64_Val _UINT8_(0x6) /* (PM_CPUSEL) Divide by 64  */
#define PM_CPUSEL_CPUDIV_DIV128_Val _UINT8_(0x7) /* (PM_CPUSEL) Divide by 128  */
#define PM_CPUSEL_CPUDIV_DIV1                                                                                          \
        (PM_CPUSEL_CPUDIV_DIV1_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 1 Position  */
#define PM_CPUSEL_CPUDIV_DIV2                                                                                          \
        (PM_CPUSEL_CPUDIV_DIV2_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 2 Position  */
#define PM_CPUSEL_CPUDIV_DIV4                                                                                          \
        (PM_CPUSEL_CPUDIV_DIV4_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 4 Position  */
#define PM_CPUSEL_CPUDIV_DIV8                                                                                          \
        (PM_CPUSEL_CPUDIV_DIV8_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 8 Position  */
#define PM_CPUSEL_CPUDIV_DIV16                                                                                         \
        (PM_CPUSEL_CPUDIV_DIV16_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 16 Position  */
#define PM_CPUSEL_CPUDIV_DIV32                                                                                         \
        (PM_CPUSEL_CPUDIV_DIV32_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 32 Position  */
#define PM_CPUSEL_CPUDIV_DIV64                                                                                         \
        (PM_CPUSEL_CPUDIV_DIV64_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 64 Position  */
#define PM_CPUSEL_CPUDIV_DIV128                                                                                        \
        (PM_CPUSEL_CPUDIV_DIV128_Val << PM_CPUSEL_CPUDIV_Pos) /* (PM_CPUSEL) Divide by 128 Position  */
#define PM_CPUSEL_Msk _UINT8_(0x07) /* (PM_CPUSEL) Register Mask  */


