ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/pm.h
/* -------- PM_APBAMASK : (PM Offset: 0x18) (R/W 32) APBA Mask -------- */
#define PM_APBAMASK_RESETVALUE _UINT32_(0x7F) /*  (PM_APBAMASK) APBA Mask  Reset Value */

#define PM_APBAMASK_PAC0_Pos _UINT32_(0) /* (PM_APBAMASK) PAC0 APB Clock Enable Position */
#define PM_APBAMASK_PAC0_Msk (_UINT32_(0x1) << PM_APBAMASK_PAC0_Pos) /* (PM_APBAMASK) PAC0 APB Clock Enable Mask */
#define PM_APBAMASK_PAC0(value)                                                                                        \
        (PM_APBAMASK_PAC0_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBAMASK_PAC0_Pos)) /* Assigment of value for PAC0 in the PM_APBAMASK register */
#define PM_APBAMASK_PM_Pos _UINT32_(1) /* (PM_APBAMASK) PM APB Clock Enable Position */
#define PM_APBAMASK_PM_Msk (_UINT32_(0x1) << PM_APBAMASK_PM_Pos) /* (PM_APBAMASK) PM APB Clock Enable Mask */
#define PM_APBAMASK_PM(value)                                                                                          \
        (PM_APBAMASK_PM_Msk &                                                                                          \
         (_UINT32_(value) << PM_APBAMASK_PM_Pos)) /* Assigment of value for PM in the PM_APBAMASK register */
#define PM_APBAMASK_SYSCTRL_Pos _UINT32_(2) /* (PM_APBAMASK) SYSCTRL APB Clock Enable Position */
#define PM_APBAMASK_SYSCTRL_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBAMASK_SYSCTRL_Pos) /* (PM_APBAMASK) SYSCTRL APB Clock Enable Mask */
#define PM_APBAMASK_SYSCTRL(value)                                                                                     \
        (PM_APBAMASK_SYSCTRL_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBAMASK_SYSCTRL_Pos)) /* Assigment of value for SYSCTRL in the PM_APBAMASK register */
#define PM_APBAMASK_GCLK_Pos _UINT32_(3) /* (PM_APBAMASK) GCLK APB Clock Enable Position */
#define PM_APBAMASK_GCLK_Msk (_UINT32_(0x1) << PM_APBAMASK_GCLK_Pos) /* (PM_APBAMASK) GCLK APB Clock Enable Mask */
#define PM_APBAMASK_GCLK(value)                                                                                        \
        (PM_APBAMASK_GCLK_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBAMASK_GCLK_Pos)) /* Assigment of value for GCLK in the PM_APBAMASK register */
#define PM_APBAMASK_WDT_Pos _UINT32_(4) /* (PM_APBAMASK) WDT APB Clock Enable Position */
#define PM_APBAMASK_WDT_Msk (_UINT32_(0x1) << PM_APBAMASK_WDT_Pos) /* (PM_APBAMASK) WDT APB Clock Enable Mask */
#define PM_APBAMASK_WDT(value)                                                                                         \
        (PM_APBAMASK_WDT_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBAMASK_WDT_Pos)) /* Assigment of value for WDT in the PM_APBAMASK register */
#define PM_APBAMASK_RTC_Pos _UINT32_(5) /* (PM_APBAMASK) RTC APB Clock Enable Position */
#define PM_APBAMASK_RTC_Msk (_UINT32_(0x1) << PM_APBAMASK_RTC_Pos) /* (PM_APBAMASK) RTC APB Clock Enable Mask */
#define PM_APBAMASK_RTC(value)                                                                                         \
        (PM_APBAMASK_RTC_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBAMASK_RTC_Pos)) /* Assigment of value for RTC in the PM_APBAMASK register */
#define PM_APBAMASK_EIC_Pos _UINT32_(6) /* (PM_APBAMASK) EIC APB Clock Enable Position */
#define PM_APBAMASK_EIC_Msk (_UINT32_(0x1) << PM_APBAMASK_EIC_Pos) /* (PM_APBAMASK) EIC APB Clock Enable Mask */
#define PM_APBAMASK_EIC(value)                                                                                         \
        (PM_APBAMASK_EIC_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBAMASK_EIC_Pos)) /* Assigment of value for EIC in the PM_APBAMASK register */
#define PM_APBAMASK_Msk _UINT32_(0x0000007F) /* (PM_APBAMASK) Register Mask  */

#define PM_APBAMASK_PAC_Pos _UINT32_(0) /* (PM_APBAMASK Position) PACx APB Clock Enable */
#define PM_APBAMASK_PAC_Msk (_UINT32_(0x1) << PM_APBAMASK_PAC_Pos) /* (PM_APBAMASK Mask) PAC */
#define PM_APBAMASK_PAC(value) (PM_APBAMASK_PAC_Msk & (_UINT32_(value) << PM_APBAMASK_PAC_Pos))

/* -------- PM_APBBMASK : (PM Offset: 0x1C) (R/W 32) APBB Mask -------- */
#define PM_APBBMASK_RESETVALUE _UINT32_(0x7F) /*  (PM_APBBMASK) APBB Mask  Reset Value */

#define PM_APBBMASK_PAC1_Pos _UINT32_(0) /* (PM_APBBMASK) PAC1 APB Clock Enable Position */
#define PM_APBBMASK_PAC1_Msk (_UINT32_(0x1) << PM_APBBMASK_PAC1_Pos) /* (PM_APBBMASK) PAC1 APB Clock Enable Mask */
#define PM_APBBMASK_PAC1(value)                                                                                        \
        (PM_APBBMASK_PAC1_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBBMASK_PAC1_Pos)) /* Assigment of value for PAC1 in the PM_APBBMASK register */
#define PM_APBBMASK_DSU_Pos _UINT32_(1) /* (PM_APBBMASK) DSU APB Clock Enable Position */
#define PM_APBBMASK_DSU_Msk (_UINT32_(0x1) << PM_APBBMASK_DSU_Pos) /* (PM_APBBMASK) DSU APB Clock Enable Mask */
#define PM_APBBMASK_DSU(value)                                                                                         \
        (PM_APBBMASK_DSU_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBBMASK_DSU_Pos)) /* Assigment of value for DSU in the PM_APBBMASK register */
#define PM_APBBMASK_NVMCTRL_Pos _UINT32_(2) /* (PM_APBBMASK) NVMCTRL APB Clock Enable Position */
#define PM_APBBMASK_NVMCTRL_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBBMASK_NVMCTRL_Pos) /* (PM_APBBMASK) NVMCTRL APB Clock Enable Mask */
#define PM_APBBMASK_NVMCTRL(value)                                                                                     \
        (PM_APBBMASK_NVMCTRL_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBBMASK_NVMCTRL_Pos)) /* Assigment of value for NVMCTRL in the PM_APBBMASK register */
#define PM_APBBMASK_PORT_Pos _UINT32_(3) /* (PM_APBBMASK) PORT APB Clock Enable Position */
#define PM_APBBMASK_PORT_Msk (_UINT32_(0x1) << PM_APBBMASK_PORT_Pos) /* (PM_APBBMASK) PORT APB Clock Enable Mask */
#define PM_APBBMASK_PORT(value)                                                                                        \
        (PM_APBBMASK_PORT_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBBMASK_PORT_Pos)) /* Assigment of value for PORT in the PM_APBBMASK register */
#define PM_APBBMASK_DMAC_Pos _UINT32_(4) /* (PM_APBBMASK) DMAC APB Clock Enable Position */
#define PM_APBBMASK_DMAC_Msk (_UINT32_(0x1) << PM_APBBMASK_DMAC_Pos) /* (PM_APBBMASK) DMAC APB Clock Enable Mask */
#define PM_APBBMASK_DMAC(value)                                                                                        \
        (PM_APBBMASK_DMAC_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBBMASK_DMAC_Pos)) /* Assigment of value for DMAC in the PM_APBBMASK register */
#define PM_APBBMASK_USB_Pos _UINT32_(5) /* (PM_APBBMASK) USB APB Clock Enable Position */
#define PM_APBBMASK_USB_Msk (_UINT32_(0x1) << PM_APBBMASK_USB_Pos) /* (PM_APBBMASK) USB APB Clock Enable Mask */
#define PM_APBBMASK_USB(value)                                                                                         \
        (PM_APBBMASK_USB_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBBMASK_USB_Pos)) /* Assigment of value for USB in the PM_APBBMASK register */
#define PM_APBBMASK_HMATRIX_Pos _UINT32_(6) /* (PM_APBBMASK) HMATRIX APB Clock Enable Position */
#define PM_APBBMASK_HMATRIX_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBBMASK_HMATRIX_Pos) /* (PM_APBBMASK) HMATRIX APB Clock Enable Mask */
#define PM_APBBMASK_HMATRIX(value)                                                                                     \
        (PM_APBBMASK_HMATRIX_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBBMASK_HMATRIX_Pos)) /* Assigment of value for HMATRIX in the PM_APBBMASK register */
#define PM_APBBMASK_Msk _UINT32_(0x0000007F) /* (PM_APBBMASK) Register Mask  */

