ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/pm.h
#define PM_APBBMASK_PAC_Pos _UINT32_(0) /* (PM_APBBMASK Position) PACx APB Clock Enable */
#define PM_APBBMASK_PAC_Msk (_UINT32_(0x1) << PM_APBBMASK_PAC_Pos) /* (PM_APBBMASK Mask) PAC */
#define PM_APBBMASK_PAC(value) (PM_APBBMASK_PAC_Msk & (_UINT32_(value) << PM_APBBMASK_PAC_Pos))

/* -------- PM_APBCMASK : (PM Offset: 0x20) (R/W 32) APBC Mask -------- */
#define PM_APBCMASK_RESETVALUE _UINT32_(0x10000) /*  (PM_APBCMASK) APBC Mask  Reset Value */

#define PM_APBCMASK_PAC2_Pos _UINT32_(0) /* (PM_APBCMASK) PAC2 APB Clock Enable Position */
#define PM_APBCMASK_PAC2_Msk (_UINT32_(0x1) << PM_APBCMASK_PAC2_Pos) /* (PM_APBCMASK) PAC2 APB Clock Enable Mask */
#define PM_APBCMASK_PAC2(value)                                                                                        \
        (PM_APBCMASK_PAC2_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBCMASK_PAC2_Pos)) /* Assigment of value for PAC2 in the PM_APBCMASK register */
#define PM_APBCMASK_EVSYS_Pos _UINT32_(1) /* (PM_APBCMASK) EVSYS APB Clock Enable Position */
#define PM_APBCMASK_EVSYS_Msk (_UINT32_(0x1) << PM_APBCMASK_EVSYS_Pos) /* (PM_APBCMASK) EVSYS APB Clock Enable Mask */
#define PM_APBCMASK_EVSYS(value)                                                                                       \
        (PM_APBCMASK_EVSYS_Msk &                                                                                       \
         (_UINT32_(value) << PM_APBCMASK_EVSYS_Pos)) /* Assigment of value for EVSYS in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM0_Pos _UINT32_(2) /* (PM_APBCMASK) SERCOM0 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM0_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBCMASK_SERCOM0_Pos) /* (PM_APBCMASK) SERCOM0 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM0(value)                                                                                     \
        (PM_APBCMASK_SERCOM0_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBCMASK_SERCOM0_Pos)) /* Assigment of value for SERCOM0 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM1_Pos _UINT32_(3) /* (PM_APBCMASK) SERCOM1 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM1_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBCMASK_SERCOM1_Pos) /* (PM_APBCMASK) SERCOM1 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM1(value)                                                                                     \
        (PM_APBCMASK_SERCOM1_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBCMASK_SERCOM1_Pos)) /* Assigment of value for SERCOM1 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM2_Pos _UINT32_(4) /* (PM_APBCMASK) SERCOM2 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM2_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBCMASK_SERCOM2_Pos) /* (PM_APBCMASK) SERCOM2 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM2(value)                                                                                     \
        (PM_APBCMASK_SERCOM2_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBCMASK_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM3_Pos _UINT32_(5) /* (PM_APBCMASK) SERCOM3 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM3_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBCMASK_SERCOM3_Pos) /* (PM_APBCMASK) SERCOM3 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM3(value)                                                                                     \
        (PM_APBCMASK_SERCOM3_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBCMASK_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM4_Pos _UINT32_(6) /* (PM_APBCMASK) SERCOM4 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM4_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBCMASK_SERCOM4_Pos) /* (PM_APBCMASK) SERCOM4 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM4(value)                                                                                     \
        (PM_APBCMASK_SERCOM4_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBCMASK_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM5_Pos _UINT32_(7) /* (PM_APBCMASK) SERCOM5 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM5_Msk                                                                                        \
        (_UINT32_(0x1) << PM_APBCMASK_SERCOM5_Pos) /* (PM_APBCMASK) SERCOM5 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM5(value)                                                                                     \
        (PM_APBCMASK_SERCOM5_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PM_APBCMASK_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PM_APBCMASK register */
#define PM_APBCMASK_TCC0_Pos _UINT32_(8) /* (PM_APBCMASK) TCC0 APB Clock Enable Position */
#define PM_APBCMASK_TCC0_Msk (_UINT32_(0x1) << PM_APBCMASK_TCC0_Pos) /* (PM_APBCMASK) TCC0 APB Clock Enable Mask */
#define PM_APBCMASK_TCC0(value)                                                                                        \
        (PM_APBCMASK_TCC0_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBCMASK_TCC0_Pos)) /* Assigment of value for TCC0 in the PM_APBCMASK register */
#define PM_APBCMASK_TCC1_Pos _UINT32_(9) /* (PM_APBCMASK) TCC1 APB Clock Enable Position */
#define PM_APBCMASK_TCC1_Msk (_UINT32_(0x1) << PM_APBCMASK_TCC1_Pos) /* (PM_APBCMASK) TCC1 APB Clock Enable Mask */
#define PM_APBCMASK_TCC1(value)                                                                                        \
        (PM_APBCMASK_TCC1_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBCMASK_TCC1_Pos)) /* Assigment of value for TCC1 in the PM_APBCMASK register */
#define PM_APBCMASK_TCC2_Pos _UINT32_(10) /* (PM_APBCMASK) TCC2 APB Clock Enable Position */
#define PM_APBCMASK_TCC2_Msk (_UINT32_(0x1) << PM_APBCMASK_TCC2_Pos) /* (PM_APBCMASK) TCC2 APB Clock Enable Mask */
#define PM_APBCMASK_TCC2(value)                                                                                        \
        (PM_APBCMASK_TCC2_Msk &                                                                                        \
         (_UINT32_(value) << PM_APBCMASK_TCC2_Pos)) /* Assigment of value for TCC2 in the PM_APBCMASK register */
#define PM_APBCMASK_TC3_Pos _UINT32_(11) /* (PM_APBCMASK) TC3 APB Clock Enable Position */
#define PM_APBCMASK_TC3_Msk (_UINT32_(0x1) << PM_APBCMASK_TC3_Pos) /* (PM_APBCMASK) TC3 APB Clock Enable Mask */
#define PM_APBCMASK_TC3(value)                                                                                         \
        (PM_APBCMASK_TC3_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_TC3_Pos)) /* Assigment of value for TC3 in the PM_APBCMASK register */
#define PM_APBCMASK_TC4_Pos _UINT32_(12) /* (PM_APBCMASK) TC4 APB Clock Enable Position */
#define PM_APBCMASK_TC4_Msk (_UINT32_(0x1) << PM_APBCMASK_TC4_Pos) /* (PM_APBCMASK) TC4 APB Clock Enable Mask */
#define PM_APBCMASK_TC4(value)                                                                                         \
        (PM_APBCMASK_TC4_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_TC4_Pos)) /* Assigment of value for TC4 in the PM_APBCMASK register */
#define PM_APBCMASK_TC5_Pos _UINT32_(13) /* (PM_APBCMASK) TC5 APB Clock Enable Position */
#define PM_APBCMASK_TC5_Msk (_UINT32_(0x1) << PM_APBCMASK_TC5_Pos) /* (PM_APBCMASK) TC5 APB Clock Enable Mask */
#define PM_APBCMASK_TC5(value)                                                                                         \
        (PM_APBCMASK_TC5_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_TC5_Pos)) /* Assigment of value for TC5 in the PM_APBCMASK register */
#define PM_APBCMASK_TC6_Pos _UINT32_(14) /* (PM_APBCMASK) TC6 APB Clock Enable Position */
#define PM_APBCMASK_TC6_Msk (_UINT32_(0x1) << PM_APBCMASK_TC6_Pos) /* (PM_APBCMASK) TC6 APB Clock Enable Mask */
#define PM_APBCMASK_TC6(value)                                                                                         \
        (PM_APBCMASK_TC6_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_TC6_Pos)) /* Assigment of value for TC6 in the PM_APBCMASK register */
#define PM_APBCMASK_TC7_Pos _UINT32_(15) /* (PM_APBCMASK) TC7 APB Clock Enable Position */
#define PM_APBCMASK_TC7_Msk (_UINT32_(0x1) << PM_APBCMASK_TC7_Pos) /* (PM_APBCMASK) TC7 APB Clock Enable Mask */
#define PM_APBCMASK_TC7(value)                                                                                         \
        (PM_APBCMASK_TC7_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_TC7_Pos)) /* Assigment of value for TC7 in the PM_APBCMASK register */
#define PM_APBCMASK_ADC_Pos _UINT32_(16) /* (PM_APBCMASK) ADC APB Clock Enable Position */
#define PM_APBCMASK_ADC_Msk (_UINT32_(0x1) << PM_APBCMASK_ADC_Pos) /* (PM_APBCMASK) ADC APB Clock Enable Mask */
#define PM_APBCMASK_ADC(value)                                                                                         \
        (PM_APBCMASK_ADC_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_ADC_Pos)) /* Assigment of value for ADC in the PM_APBCMASK register */
#define PM_APBCMASK_AC_Pos _UINT32_(17) /* (PM_APBCMASK) AC APB Clock Enable Position */
#define PM_APBCMASK_AC_Msk (_UINT32_(0x1) << PM_APBCMASK_AC_Pos) /* (PM_APBCMASK) AC APB Clock Enable Mask */
#define PM_APBCMASK_AC(value)                                                                                          \
        (PM_APBCMASK_AC_Msk &                                                                                          \
         (_UINT32_(value) << PM_APBCMASK_AC_Pos)) /* Assigment of value for AC in the PM_APBCMASK register */
#define PM_APBCMASK_DAC_Pos _UINT32_(18) /* (PM_APBCMASK) DAC APB Clock Enable Position */
#define PM_APBCMASK_DAC_Msk (_UINT32_(0x1) << PM_APBCMASK_DAC_Pos) /* (PM_APBCMASK) DAC APB Clock Enable Mask */
#define PM_APBCMASK_DAC(value)                                                                                         \
        (PM_APBCMASK_DAC_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_DAC_Pos)) /* Assigment of value for DAC in the PM_APBCMASK register */
#define PM_APBCMASK_PTC_Pos _UINT32_(19) /* (PM_APBCMASK) PTC APB Clock Enable Position */
#define PM_APBCMASK_PTC_Msk (_UINT32_(0x1) << PM_APBCMASK_PTC_Pos) /* (PM_APBCMASK) PTC APB Clock Enable Mask */
#define PM_APBCMASK_PTC(value)                                                                                         \
        (PM_APBCMASK_PTC_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_PTC_Pos)) /* Assigment of value for PTC in the PM_APBCMASK register */
#define PM_APBCMASK_I2S_Pos _UINT32_(20) /* (PM_APBCMASK) I2S APB Clock Enable Position */
#define PM_APBCMASK_I2S_Msk (_UINT32_(0x1) << PM_APBCMASK_I2S_Pos) /* (PM_APBCMASK) I2S APB Clock Enable Mask */
#define PM_APBCMASK_I2S(value)                                                                                         \
        (PM_APBCMASK_I2S_Msk &                                                                                         \
         (_UINT32_(value) << PM_APBCMASK_I2S_Pos)) /* Assigment of value for I2S in the PM_APBCMASK register */
#define PM_APBCMASK_Msk _UINT32_(0x001FFFFF) /* (PM_APBCMASK) Register Mask  */

#define PM_APBCMASK_PAC_Pos _UINT32_(0) /* (PM_APBCMASK Position) PAC2 APB Clock Enable */
#define PM_APBCMASK_PAC_Msk (_UINT32_(0x1) << PM_APBCMASK_PAC_Pos) /* (PM_APBCMASK Mask) PAC */
#define PM_APBCMASK_PAC(value) (PM_APBCMASK_PAC_Msk & (_UINT32_(value) << PM_APBCMASK_PAC_Pos))
#define PM_APBCMASK_SERCOM_Pos _UINT32_(2) /* (PM_APBCMASK Position) SERCOMx APB Clock Enable */
#define PM_APBCMASK_SERCOM_Msk (_UINT32_(0x3F) << PM_APBCMASK_SERCOM_Pos) /* (PM_APBCMASK Mask) SERCOM */
#define PM_APBCMASK_SERCOM(value) (PM_APBCMASK_SERCOM_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM_Pos))
#define PM_APBCMASK_TCC_Pos _UINT32_(8) /* (PM_APBCMASK Position) TCCx APB Clock Enable */
#define PM_APBCMASK_TCC_Msk (_UINT32_(0x7) << PM_APBCMASK_TCC_Pos) /* (PM_APBCMASK Mask) TCC */
#define PM_APBCMASK_TCC(value) (PM_APBCMASK_TCC_Msk & (_UINT32_(value) << PM_APBCMASK_TCC_Pos))
#define PM_APBCMASK_TC_Pos _UINT32_(11) /* (PM_APBCMASK Position) TC3 APB Clock Enable */
#define PM_APBCMASK_TC_Msk (_UINT32_(0x1F) << PM_APBCMASK_TC_Pos) /* (PM_APBCMASK Mask) TC */
#define PM_APBCMASK_TC(value) (PM_APBCMASK_TC_Msk & (_UINT32_(value) << PM_APBCMASK_TC_Pos))

/* -------- PM_INTENCLR : (PM Offset: 0x34) (R/W 8) Interrupt Enable Clear -------- */
#define PM_INTENCLR_RESETVALUE _UINT8_(0x00) /*  (PM_INTENCLR) Interrupt Enable Clear  Reset Value */

#define PM_INTENCLR_CKRDY_Pos _UINT8_(0) /* (PM_INTENCLR) Clock Ready Interrupt Enable Position */
#define PM_INTENCLR_CKRDY_Msk                                                                                          \
        (_UINT8_(0x1) << PM_INTENCLR_CKRDY_Pos) /* (PM_INTENCLR) Clock Ready Interrupt Enable Mask */
#define PM_INTENCLR_CKRDY(value)                                                                                       \
        (PM_INTENCLR_CKRDY_Msk &                                                                                       \
         (_UINT8_(value) << PM_INTENCLR_CKRDY_Pos)) /* Assigment of value for CKRDY in the PM_INTENCLR register */
#define PM_INTENCLR_Msk _UINT8_(0x01) /* (PM_INTENCLR) Register Mask  */


/* -------- PM_INTENSET : (PM Offset: 0x35) (R/W 8) Interrupt Enable Set -------- */
#define PM_INTENSET_RESETVALUE _UINT8_(0x00) /*  (PM_INTENSET) Interrupt Enable Set  Reset Value */

#define PM_INTENSET_CKRDY_Pos _UINT8_(0) /* (PM_INTENSET) Clock Ready Interrupt Enable Position */
#define PM_INTENSET_CKRDY_Msk                                                                                          \
        (_UINT8_(0x1) << PM_INTENSET_CKRDY_Pos) /* (PM_INTENSET) Clock Ready Interrupt Enable Mask */
#define PM_INTENSET_CKRDY(value)                                                                                       \
        (PM_INTENSET_CKRDY_Msk &                                                                                       \
         (_UINT8_(value) << PM_INTENSET_CKRDY_Pos)) /* Assigment of value for CKRDY in the PM_INTENSET register */
#define PM_INTENSET_Msk _UINT8_(0x01) /* (PM_INTENSET) Register Mask  */


/* -------- PM_INTFLAG : (PM Offset: 0x36) (R/W 8) Interrupt Flag Status and Clear -------- */
#define PM_INTFLAG_RESETVALUE _UINT8_(0x00) /*  (PM_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define PM_INTFLAG_CKRDY_Pos _UINT8_(0) /* (PM_INTFLAG) Clock Ready Position */
#define PM_INTFLAG_CKRDY_Msk (_UINT8_(0x1) << PM_INTFLAG_CKRDY_Pos) /* (PM_INTFLAG) Clock Ready Mask */
#define PM_INTFLAG_CKRDY(value)                                                                                        \
        (PM_INTFLAG_CKRDY_Msk &                                                                                        \
         (_UINT8_(value) << PM_INTFLAG_CKRDY_Pos)) /* Assigment of value for CKRDY in the PM_INTFLAG register */
#define PM_INTFLAG_Msk _UINT8_(0x01) /* (PM_INTFLAG) Register Mask  */


/* -------- PM_RCAUSE : (PM Offset: 0x38) ( R/ 8) Reset Cause -------- */
#define PM_RCAUSE_RESETVALUE _UINT8_(0x01) /*  (PM_RCAUSE) Reset Cause  Reset Value */

#define PM_RCAUSE_POR_Pos _UINT8_(0) /* (PM_RCAUSE) Power On Reset Position */
#define PM_RCAUSE_POR_Msk (_UINT8_(0x1) << PM_RCAUSE_POR_Pos) /* (PM_RCAUSE) Power On Reset Mask */
#define PM_RCAUSE_POR(value)                                                                                           \
        (PM_RCAUSE_POR_Msk &                                                                                           \
         (_UINT8_(value) << PM_RCAUSE_POR_Pos)) /* Assigment of value for POR in the PM_RCAUSE register */
#define PM_RCAUSE_BOD12_Pos _UINT8_(1) /* (PM_RCAUSE) Brown Out 12 Detector Reset Position */
#define PM_RCAUSE_BOD12_Msk (_UINT8_(0x1) << PM_RCAUSE_BOD12_Pos) /* (PM_RCAUSE) Brown Out 12 Detector Reset Mask */
#define PM_RCAUSE_BOD12(value)                                                                                         \
        (PM_RCAUSE_BOD12_Msk &                                                                                         \
         (_UINT8_(value) << PM_RCAUSE_BOD12_Pos)) /* Assigment of value for BOD12 in the PM_RCAUSE register */
#define PM_RCAUSE_BOD33_Pos _UINT8_(2) /* (PM_RCAUSE) Brown Out 33 Detector Reset Position */
#define PM_RCAUSE_BOD33_Msk (_UINT8_(0x1) << PM_RCAUSE_BOD33_Pos) /* (PM_RCAUSE) Brown Out 33 Detector Reset Mask */
#define PM_RCAUSE_BOD33(value)                                                                                         \
        (PM_RCAUSE_BOD33_Msk &                                                                                         \
         (_UINT8_(value) << PM_RCAUSE_BOD33_Pos)) /* Assigment of value for BOD33 in the PM_RCAUSE register */
#define PM_RCAUSE_EXT_Pos _UINT8_(4) /* (PM_RCAUSE) External Reset Position */
#define PM_RCAUSE_EXT_Msk (_UINT8_(0x1) << PM_RCAUSE_EXT_Pos) /* (PM_RCAUSE) External Reset Mask */
#define PM_RCAUSE_EXT(value)                                                                                           \
        (PM_RCAUSE_EXT_Msk &                                                                                           \
         (_UINT8_(value) << PM_RCAUSE_EXT_Pos)) /* Assigment of value for EXT in the PM_RCAUSE register */
#define PM_RCAUSE_WDT_Pos _UINT8_(5) /* (PM_RCAUSE) Watchdog Reset Position */
#define PM_RCAUSE_WDT_Msk (_UINT8_(0x1) << PM_RCAUSE_WDT_Pos) /* (PM_RCAUSE) Watchdog Reset Mask */
#define PM_RCAUSE_WDT(value)                                                                                           \
        (PM_RCAUSE_WDT_Msk &                                                                                           \
         (_UINT8_(value) << PM_RCAUSE_WDT_Pos)) /* Assigment of value for WDT in the PM_RCAUSE register */
#define PM_RCAUSE_SYST_Pos _UINT8_(6) /* (PM_RCAUSE) System Reset Request Position */
#define PM_RCAUSE_SYST_Msk (_UINT8_(0x1) << PM_RCAUSE_SYST_Pos) /* (PM_RCAUSE) System Reset Request Mask */
#define PM_RCAUSE_SYST(value)                                                                                          \
        (PM_RCAUSE_SYST_Msk &                                                                                          \
         (_UINT8_(value) << PM_RCAUSE_SYST_Pos)) /* Assigment of value for SYST in the PM_RCAUSE register */
#define PM_RCAUSE_Msk _UINT8_(0x77) /* (PM_RCAUSE) Register Mask  */

