ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/pm.h
#define PM_RCAUSE_BOD_Pos _UINT8_(1) /* (PM_RCAUSE Position) Brown Out x2 Detector Reset */
#define PM_RCAUSE_BOD_Msk (_UINT8_(0x3) << PM_RCAUSE_BOD_Pos) /* (PM_RCAUSE Mask) BOD */
#define PM_RCAUSE_BOD(value) (PM_RCAUSE_BOD_Msk & (_UINT8_(value) << PM_RCAUSE_BOD_Pos))

/** \brief PM register offsets definitions */
#define PM_CTRL_REG_OFST _UINT32_(0x00) /* (PM_CTRL) Control Offset */
#define PM_SLEEP_REG_OFST _UINT32_(0x01) /* (PM_SLEEP) Sleep Mode Offset */
#define PM_CPUSEL_REG_OFST _UINT32_(0x08) /* (PM_CPUSEL) CPU Clock Select Offset */
#define PM_APBASEL_REG_OFST _UINT32_(0x09) /* (PM_APBASEL) APBA Clock Select Offset */
#define PM_APBBSEL_REG_OFST _UINT32_(0x0A) /* (PM_APBBSEL) APBB Clock Select Offset */
#define PM_APBCSEL_REG_OFST _UINT32_(0x0B) /* (PM_APBCSEL) APBC Clock Select Offset */
#define PM_AHBMASK_REG_OFST _UINT32_(0x14) /* (PM_AHBMASK) AHB Mask Offset */
#define PM_APBAMASK_REG_OFST _UINT32_(0x18) /* (PM_APBAMASK) APBA Mask Offset */
#define PM_APBBMASK_REG_OFST _UINT32_(0x1C) /* (PM_APBBMASK) APBB Mask Offset */
#define PM_APBCMASK_REG_OFST _UINT32_(0x20) /* (PM_APBCMASK) APBC Mask Offset */
#define PM_INTENCLR_REG_OFST _UINT32_(0x34) /* (PM_INTENCLR) Interrupt Enable Clear Offset */
#define PM_INTENSET_REG_OFST _UINT32_(0x35) /* (PM_INTENSET) Interrupt Enable Set Offset */
#define PM_INTFLAG_REG_OFST _UINT32_(0x36) /* (PM_INTFLAG) Interrupt Flag Status and Clear Offset */
#define PM_RCAUSE_REG_OFST _UINT32_(0x38) /* (PM_RCAUSE) Reset Cause Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PM register API structure */
typedef struct { /* Power Manager */
        __IO uint8_t PM_CTRL; /**< Offset: 0x00 (R/W  8) Control */
        __IO uint8_t PM_SLEEP; /**< Offset: 0x01 (R/W  8) Sleep Mode */
        __I uint8_t Reserved1[0x06];
        __IO uint8_t PM_CPUSEL; /**< Offset: 0x08 (R/W  8) CPU Clock Select */
        __IO uint8_t PM_APBASEL; /**< Offset: 0x09 (R/W  8) APBA Clock Select */
        __IO uint8_t PM_APBBSEL; /**< Offset: 0x0A (R/W  8) APBB Clock Select */
        __IO uint8_t PM_APBCSEL; /**< Offset: 0x0B (R/W  8) APBC Clock Select */
        __I uint8_t Reserved2[0x08];
        __IO uint32_t PM_AHBMASK; /**< Offset: 0x14 (R/W  32) AHB Mask */
        __IO uint32_t PM_APBAMASK; /**< Offset: 0x18 (R/W  32) APBA Mask */
        __IO uint32_t PM_APBBMASK; /**< Offset: 0x1C (R/W  32) APBB Mask */
        __IO uint32_t PM_APBCMASK; /**< Offset: 0x20 (R/W  32) APBC Mask */
        __I uint8_t Reserved3[0x10];
        __IO uint8_t PM_INTENCLR; /**< Offset: 0x34 (R/W  8) Interrupt Enable Clear */
        __IO uint8_t PM_INTENSET; /**< Offset: 0x35 (R/W  8) Interrupt Enable Set */
        __IO uint8_t PM_INTFLAG; /**< Offset: 0x36 (R/W  8) Interrupt Flag Status and Clear */
        __I uint8_t Reserved4[0x01];
        __I uint8_t PM_RCAUSE; /**< Offset: 0x38 (R/   8) Reset Cause */
} pm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_PM_COMPONENT_H_ */
